1s/ERP/Conf/Documents/Лико_ПодготовкаМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПодготовкаМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_МатериалыВРезерве</xr:Item>
				<xr:Item>InformationRegister.Лико_ПодготовленныеМатериалы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеМатериала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриходаМатериала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиНаличияМатериала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаМатериала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаНарезки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаДопМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеМатериалыСтрокойЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриходаМатериалаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НарезкаЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятиеРезерва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиТребования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСниматьРезервПослеЗакрытияБланка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Резервирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаетсяПриход</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаетсяПереработка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНастроечногоМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Печать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПодготовкаМатериалов/Ext/ManagerModule.bsl
#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных; 
	
КонецФункции


Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект)
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.Дата КАК Период,
	|	Лико_ПодготовкаМатериалов.Номер КАК Номер,
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ПодготовкаМатериалов.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ПодготовкаМатериалов.Организация КАК Организация,
	|	Лико_ПодготовкаМатериалов.Склад КАК Склад,
	|	Лико_ПодготовкаМатериалов.НомерПроката КАК НомерПроката
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	
	Запрос.УстановитьПараметр("Склад",       				Реквизиты.Склад);
	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);
	Запрос.УстановитьПараметр("РабочийЦентр",      			Реквизиты.РабочийЦентр);
	Запрос.УстановитьПараметр("ЗаказКлиента", 				Реквизиты.ЗаказКлиента);
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Запрос.УстановитьПараметр("НомерПроката",    			Реквизиты.НомерПроката);
	
	Если ДокументСсылка.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра И
		ДокументСсылка.РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Indigo Тогда
		Запрос.УстановитьПараметр("ЦифраЛикофлекс",    			Истина);  		
	Иначе
		Запрос.УстановитьПараметр("ЦифраЛикофлекс",    			Ложь); 		
	КонецЕсли;
	
	
	
	
КонецПроцедуры


Функция ТекстЗапросаТаблицаЛико_МатериалыВРезерве(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_МатериалыВРезерве";
	
	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ПодготовкаМатериаловРезервирование.Номенклатура КАК Номенклатура,
	|	Лико_ПодготовкаМатериаловРезервирование.Характеристика КАК Характеристика,
	|	&НомерПроката КАК НомерПроката,
	|	Лико_ПодготовкаМатериаловРезервирование.КоличествоУпаковок КАК Количество,
	|	&Организация КАК Организация,
	|	&Склад КАК Склад,
	|	Лико_ПодготовкаМатериаловРезервирование.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
	|ГДЕ
	|	Лико_ПодготовкаМатериаловРезервирование.Ссылка = &Ссылка
	|	И НЕ Лико_ПодготовкаМатериаловРезервирование.Ссылка.СнятиеРезерва
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Закрыт)
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Выполнен)
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.Пустаяссылка)
	|	И НЕ &ЦифраЛикофлекс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВложенныйЗапрос.ЗаказКлиента,
	|	Лико_ТоварыКРаспределению.Номенклатура,
	|	Лико_ТоварыКРаспределению.Характеристика,
	|	&НомерПроката,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.КоличествоУпаковок - Лико_ТоварыКРаспределению.Количество < 0
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ТоварыКРаспределению.Количество
	|		КОНЕЦ),
	|	&Организация,
	|	&Склад,
	|	ВложенныйЗапрос.ВидНастроечногоМатериала
	|ИЗ
	|	(ВЫБРАТЬ
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|		Лико_ПодготовкаМатериаловРезервирование.Номенклатура КАК Номенклатура,
	|		Лико_ПодготовкаМатериаловРезервирование.Характеристика КАК Характеристика,
	|		СУММА(Лико_ПодготовкаМатериаловРезервирование.КоличествоУпаковок) КАК КоличествоУпаковок,
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка КАК Ссылка,
	|		Лико_ПодготовкаМатериаловРезервирование.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|	ИЗ
	|		Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
	|	ГДЕ
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка = &Ссылка
	|		И НЕ Лико_ПодготовкаМатериаловРезервирование.Ссылка.СнятиеРезерва
	|		И Лико_ПодготовкаМатериаловРезервирование.Ссылка.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента,
	|		Лико_ПодготовкаМатериаловРезервирование.Номенклатура,
	|		Лико_ПодготовкаМатериаловРезервирование.Характеристика,
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка,
	|		Лико_ПодготовкаМатериаловРезервирование.ВидНастроечногоМатериала) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ТоварыКРаспределению КАК Лико_ТоварыКРаспределению
	|		ПО ВложенныйЗапрос.ЗаказКлиента = Лико_ТоварыКРаспределению.ЗаказКлиента
	|			И ВложенныйЗапрос.Номенклатура = Лико_ТоварыКРаспределению.Номенклатура
	|			И ВложенныйЗапрос.Характеристика = Лико_ТоварыКРаспределению.Характеристика
	|			И ВложенныйЗапрос.Ссылка.РабочийЦентр = Лико_ТоварыКРаспределению.РабочийЦентр
	|ГДЕ
	|	НЕ ВложенныйЗапрос.Ссылка.СнятиеРезерва
	|	И ВложенныйЗапрос.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Закрыт)
	|	И ВложенныйЗапрос.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Выполнен)
	|	И ВложенныйЗапрос.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
	|	И НЕ &ЦифраЛикофлекс
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ТоварыКРаспределению.Номенклатура,
	|	Лико_ТоварыКРаспределению.Характеристика,
	|	ВложенныйЗапрос.ЗаказКлиента,
	|	ВложенныйЗапрос.ВидНастроечногоМатериала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента,
	|	Лико_ПодготовкаМатериаловРезервирование.Номенклатура,
	|	Лико_ПодготовкаМатериаловРезервирование.Характеристика,
	|	&НомерПроката,
	|	Лико_ПодготовкаМатериаловРезервирование.КоличествоУпаковок,
	|	&Организация,
	|	&Склад,
	|	Лико_ПодготовкаМатериаловРезервирование.ВидНастроечногоМатериала
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
	|ГДЕ
	|	Лико_ПодготовкаМатериаловРезервирование.Ссылка = &Ссылка
	|	И НЕ Лико_ПодготовкаМатериаловРезервирование.Ссылка.СнятиеРезерва
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Закрыт)
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.Пустаяссылка)
	|	И &ЦифраЛикофлекс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВложенныйЗапрос.ЗаказКлиента,
	|	Лико_ТоварыКРаспределению.Номенклатура,
	|	Лико_ТоварыКРаспределению.Характеристика,
	|	&НомерПроката,
	|	МИНИМУМ(ВложенныйЗапрос.КоличествоУпаковок),
	|	&Организация,
	|	&Склад,
	|	ВложенныйЗапрос.ВидНастроечногоМатериала
	|ИЗ
	|	(ВЫБРАТЬ
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|		Лико_ПодготовкаМатериаловРезервирование.Номенклатура КАК Номенклатура,
	|		Лико_ПодготовкаМатериаловРезервирование.Характеристика КАК Характеристика,
	|		СУММА(Лико_ПодготовкаМатериаловРезервирование.КоличествоУпаковок) КАК КоличествоУпаковок,
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка КАК Ссылка,
	|		Лико_ПодготовкаМатериаловРезервирование.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|	ИЗ
	|		Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
	|	ГДЕ
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка = &Ссылка
	|		И НЕ Лико_ПодготовкаМатериаловРезервирование.Ссылка.СнятиеРезерва
	|		И Лико_ПодготовкаМатериаловРезервирование.Ссылка.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента,
	|		Лико_ПодготовкаМатериаловРезервирование.Номенклатура,
	|		Лико_ПодготовкаМатериаловРезервирование.Характеристика,
	|		Лико_ПодготовкаМатериаловРезервирование.Ссылка,
	|		Лико_ПодготовкаМатериаловРезервирование.ВидНастроечногоМатериала) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ТоварыКРаспределению КАК Лико_ТоварыКРаспределению
	|		ПО ВложенныйЗапрос.ЗаказКлиента = Лико_ТоварыКРаспределению.ЗаказКлиента
	|			И ВложенныйЗапрос.Номенклатура = Лико_ТоварыКРаспределению.Номенклатура
	|			И ВложенныйЗапрос.Характеристика = Лико_ТоварыКРаспределению.Характеристика
	|			И ВложенныйЗапрос.Ссылка.РабочийЦентр = Лико_ТоварыКРаспределению.РабочийЦентр
	|ГДЕ
	|	НЕ ВложенныйЗапрос.Ссылка.СнятиеРезерва
	|	И ВложенныйЗапрос.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Закрыт)
	|	И ВложенныйЗапрос.Ссылка.ЗаказКлиента.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
	|	И &ЦифраЛикофлекс
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ТоварыКРаспределению.Номенклатура,
	|	Лико_ТоварыКРаспределению.Характеристика,
	|	ВложенныйЗапрос.ЗаказКлиента,
	|	ВложенныйЗапрос.ВидНастроечногоМатериала";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти

#Область Отчеты

/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	//--> Маковеева А.Ю.
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	//<-- Маковеева А.Ю.
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Задание складскому работнику
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПечатьДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	////КомандаПечати.СразуНаПринтер = Истина;	
	//
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	"ПечатьДокумента",
		//	НСтр("ru = 'ПечатьДокумента'"),
		//	ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
КонецФункции
#КонецОбласти

#Область Прочее

Процедура СформироватьЗапросПоМатериалуВЗаказе(Запрос)Экспорт  //+Лико m.shenderov 21.12.2017
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Текст="ВЫБРАТЬ
	             |	Лико_Затраты.ЗаказКлиента КАК ЗаказКлиента,
	             |	Лико_Затраты.РабочийЦентр КАК РабочийЦентр,
	             |	Лико_Затраты.Затрата КАК Затрата,
	             |	Лико_Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката КАК НомерПроката,
	             |	Лико_Затраты.Нарезка КАК Нарезка,
	             |	Лико_Затраты.Количество КАК Количество,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000) КАК КоличествоУпаковок,
	             |	Лико_Затраты.Сумма КАК Сумма,
	             |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка) КАК Характеристика,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ КАК Номенклатура,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ КАК ЦеноваяГруппа,
	             |	Лико_Затраты.ВидРабот КАК ВидРабот,
	             |	Лико_Затраты.ВидСекции КАК ВидСекции,
	             |	Лико_Затраты.НомерРаботы КАК НомерРаботы
	             |ПОМЕСТИТЬ Вт
	             |ИЗ
	             |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	             |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	             |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	             |ГДЕ
	             |	Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	             |	И Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	             |	И Лико_Затраты.НомерПроката = &НомерПроката
	             |	И ЕСТЬNULL(Лико_Затраты.Нарезка, 0) <> 0
	             |	И ВЫБОР
	             |			КОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	             |				ТОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	             |			ИНАЧЕ Лико_Затраты.РабочийЦентр.ВидРабочегоЦентра = &ВидРабочегоЦентра
	             |		КОНЕЦ
	             |	И Лико_Затраты.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Лико_Затраты.ЗаказКлиента,
	             |	Лико_Затраты.РабочийЦентр,
	             |	Лико_Затраты.Затрата,
	             |	Лико_Затраты.СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката,
	             |	Лико_Затраты.Нарезка,
	             |	Лико_Затраты.Количество,
	             |	Лико_Затраты.Сумма,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ,
	             |	Лико_Затраты.ВидРабот,
	             |	Лико_Затраты.ВидСекции,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	             |	Лико_Затраты.НомерРаботы
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Лико_Затраты.ЗаказКлиента,
	             |	Лико_Затраты.РЦ,
	             |	Лико_Затраты.Затрата,
	             |	Лико_Затраты.СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката,
	             |	Лико_Затраты.Нарезка,
	             |	Лико_Затраты.Количество,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	             |	Лико_Затраты.Сумма,
	             |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка),
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ,
	             |	Лико_Затраты.ВидРабот,
	             |	Лико_Затраты.ВидСекции,
	             |	Лико_Затраты.НомерРаботы
	             |ИЗ
	             |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	             |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	             |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	             |ГДЕ
	             |	Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	             |	И Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	             |	И Лико_Затраты.НомерПроката = &НомерПроката
	             |	И ЕСТЬNULL(Лико_Затраты.Нарезка, 0) <> 0
	             |	И Лико_Затраты.РЦ.ВидРабочегоЦентра = &ВидРабочегоЦентра
	             |	И Лико_Затраты.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |	И Лико_Затраты.РЦ.ВидРабочегоЦентра <> Лико_Затраты.РабочийЦентр.ВидРабочегоЦентра
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Лико_Затраты.ЗаказКлиента,
	             |	Лико_Затраты.Затрата,
	             |	Лико_Затраты.СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката,
	             |	Лико_Затраты.Нарезка,
	             |	Лико_Затраты.Количество,
	             |	Лико_Затраты.Сумма,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ,
	             |	Лико_Затраты.РЦ,
	             |	Лико_Затраты.ВидРабот,
	             |	Лико_Затраты.ВидСекции,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	             |	Лико_Затраты.НомерРаботы
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Вт.ЗаказКлиента КАК ЗаказКлиента,
	             |	Вт.РабочийЦентр КАК РабочийЦентр,
	             |	Вт.Затрата КАК Затрата,
	             |	Вт.СтатьяЗатрат КАК СтатьяЗатрат,
	             |	Вт.НомерПроката КАК НомерПроката,
	             |	Вт.Нарезка КАК Нарезка,
	             |	Вт.Сумма КАК Сумма,
	             |	Вт.Характеристика КАК Характеристика,
	             |	Вт.Номенклатура КАК Номенклатура,
	             |	Вт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	             |	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК КоличествоУпаковок1,
	             |	ВЫБОР
	             |		КОГДА Вт.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |				И Вт.Нарезка.Размер <> 0
	             |			ТОГДА Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ * (Вт.Нарезка.Размер / 1000)
	             |	КОНЕЦ КАК Количество1,
	             |	Вт.Количество КАК Количество,
	             |	Вт.КоличествоУпаковок КАК КоличествоУпаковок,
	             |	Вт.ВидРабот КАК ВидРабот,
	             |	Вт.ВидСекции КАК ВидСекции,
	             |	Вт.НомерРаботы КАК НомерРаботы
	             |ИЗ
	             |	Вт КАК Вт
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	             |		ПО Вт.ЗаказКлиента = Лико_ПараметрыПроизводстваЗаказа.Заказ
	             |			И Вт.РабочийЦентр = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр
	             |			И Вт.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СтатьяЗатрат УБЫВ";	
	Запрос.УстановитьПараметр("ВидНоменклатурыНарезки", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра);
	
	
КонецПроцедуры //-Лико m.shenderov 21.12.2017



Процедура СформироватьЗапросПоМатериалуВЗаказеЦифраСПБ(Запрос)Экспорт  //+Лико m.shenderov 21.12.2017
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Текст="ВЫБРАТЬ
	             |	Лико_Затраты.ЗаказКлиента КАК ЗаказКлиента,
	             |	Лико_Затраты.РабочийЦентр КАК РабочийЦентр,
	             |	Лико_Затраты.Затрата КАК Затрата,
	             |	Лико_Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката КАК НомерПроката,
	             |	Лико_Затраты.Нарезка КАК Нарезка,
	             |	Лико_Затраты.Количество КАК Количество,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000) КАК КоличествоУпаковок,
	             |	Лико_Затраты.Сумма КАК Сумма,
	             |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка) КАК Характеристика,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ КАК Номенклатура,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ КАК ЦеноваяГруппа,
	             |	Лико_Затраты.ВидРабот КАК ВидРабот,
	             |	Лико_Затраты.ВидСекции КАК ВидСекции,
	             |	Лико_Затраты.НомерРаботы КАК НомерРаботы
	             |ПОМЕСТИТЬ Вт
	             |ИЗ
	             |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	             |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	             |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	             |ГДЕ
	             |	Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	             |	И Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	             |	И ЕСТЬNULL(Лико_Затраты.Нарезка, 0) <> 0
	             |	И ВЫБОР
	             |			КОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	             |				ТОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	             |			ИНАЧЕ Лико_Затраты.РабочийЦентр.ВидРабочегоЦентра = &ВидРабочегоЦентра
	             |		КОНЕЦ
	             |	И Лико_Затраты.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Лико_Затраты.ЗаказКлиента,
	             |	Лико_Затраты.РабочийЦентр,
	             |	Лико_Затраты.Затрата,
	             |	Лико_Затраты.СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката,
	             |	Лико_Затраты.Нарезка,
	             |	Лико_Затраты.Количество,
	             |	Лико_Затраты.Сумма,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ,
	             |	Лико_Затраты.ВидРабот,
	             |	Лико_Затраты.ВидСекции,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	             |	Лико_Затраты.НомерРаботы
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Лико_Затраты.ЗаказКлиента,
	             |	Лико_Затраты.РЦ,
	             |	Лико_Затраты.Затрата,
	             |	Лико_Затраты.СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката,
	             |	Лико_Затраты.Нарезка,
	             |	Лико_Затраты.Количество,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	             |	Лико_Затраты.Сумма,
	             |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка),
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ,
	             |	Лико_Затраты.ВидРабот,
	             |	Лико_Затраты.ВидСекции,
	             |	Лико_Затраты.НомерРаботы
	             |ИЗ
	             |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	             |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	             |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	             |ГДЕ
	             |	Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	             |	И Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	             |	И ЕСТЬNULL(Лико_Затраты.Нарезка, 0) <> 0
	             |	И Лико_Затраты.РЦ.ВидРабочегоЦентра = &ВидРабочегоЦентра
	             |	И Лико_Затраты.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |	И Лико_Затраты.РЦ.ВидРабочегоЦентра <> Лико_Затраты.РабочийЦентр.ВидРабочегоЦентра
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Лико_Затраты.ЗаказКлиента,
	             |	Лико_Затраты.Затрата,
	             |	Лико_Затраты.СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката,
	             |	Лико_Затраты.Нарезка,
	             |	Лико_Затраты.Количество,
	             |	Лико_Затраты.Сумма,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ,
	             |	Лико_Затраты.РЦ,
	             |	Лико_Затраты.ВидРабот,
	             |	Лико_Затраты.ВидСекции,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	             |	Лико_Затраты.НомерРаботы
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Вт.ЗаказКлиента КАК ЗаказКлиента,
	             |	Вт.РабочийЦентр КАК РабочийЦентр,
	             |	Вт.Затрата КАК Затрата,
	             |	Вт.СтатьяЗатрат КАК СтатьяЗатрат,
	             |	Вт.НомерПроката КАК НомерПроката,
	             |	Вт.Нарезка КАК Нарезка,
	             |	Вт.Сумма КАК Сумма,
	             |	Вт.Характеристика КАК Характеристика,
	             |	Вт.Номенклатура КАК Номенклатура,
	             |	Вт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	             |	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК КоличествоУпаковок1,
	             |	ВЫБОР
	             |		КОГДА Вт.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |				И Вт.Нарезка.Размер <> 0
	             |			ТОГДА Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ * (Вт.Нарезка.Размер / 1000)
	             |	КОНЕЦ КАК Количество1,
	             |	Вт.Количество КАК Количество,
	             |	Вт.КоличествоУпаковок КАК КоличествоУпаковок,
	             |	Вт.ВидРабот КАК ВидРабот,
	             |	Вт.ВидСекции КАК ВидСекции,
	             |	Вт.НомерРаботы КАК НомерРаботы
	             |ИЗ
	             |	Вт КАК Вт
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	             |		ПО Вт.ЗаказКлиента = Лико_ПараметрыПроизводстваЗаказа.Заказ
	             |			И Вт.РабочийЦентр = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр
	             |			И Вт.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СтатьяЗатрат УБЫВ";	
	Запрос.УстановитьПараметр("ВидНоменклатурыНарезки", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра);
	
	
КонецПроцедуры //-Лико m.shenderov 21.12.2017





 Процедура СформироватьЗапросПоМатериалуВЗаказеBRC(Запрос) Экспорт  //+Лико m.shenderov 21.12.2017
	 УстановитьПривилегированныйРежим(Истина);
	 Запрос.Текст="ВЫБРАТЬ
	 |	Лико_Затраты.ЗаказКлиента КАК ЗаказКлиента,
	 |	Лико_Затраты.РабочийЦентр КАК РабочийЦентр,
	 |	Лико_Затраты.Затрата КАК Затрата,
	 |	Лико_Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	 |	Лико_Затраты.НомерПроката КАК НомерПроката,
	 |	Лико_Затраты.Нарезка КАК Нарезка,
	 |	Лико_Затраты.Количество КАК Количество,
	 |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000) КАК КоличествоУпаковок,
	 |	Лико_Затраты.Сумма КАК Сумма,
	 |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка) КАК Характеристика,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	 |	КОНЕЦ КАК Номенклатура,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	 |	КОНЕЦ КАК ЦеноваяГруппа,
	 |	Лико_Затраты.ВидРабот КАК ВидРабот,
	 |	Лико_Затраты.ВидСекции КАК ВидСекции,
	 |	Лико_Затраты.НомерРаботы КАК НомерРаботы
	 |ПОМЕСТИТЬ Вт
	 |ИЗ
	 |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	 |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	 |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	 |ГДЕ
	 |	Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	 |	И Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	 |	И Лико_Затраты.НомерПроката = &НомерПроката
	 |	И ЕСТЬNULL(Лико_Затраты.Нарезка, 0) <> 0
	 |	И ВЫБОР
	 |			КОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	 |				ТОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	 |			ИНАЧЕ Лико_Затраты.РабочийЦентр.ВидРабочегоЦентра = &ВидРабочегоЦентра
	 |		КОНЕЦ
	 |	И Лико_Затраты.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Лико_Затраты.ЗаказКлиента,
	 |	Лико_Затраты.РабочийЦентр,
	 |	Лико_Затраты.Затрата,
	 |	Лико_Затраты.СтатьяЗатрат,
	 |	Лико_Затраты.НомерПроката,
	 |	Лико_Затраты.Нарезка,
	 |	Лико_Затраты.Количество,
	 |	Лико_Затраты.Сумма,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	 |	КОНЕЦ,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	 |	КОНЕЦ,
	 |	Лико_Затраты.ВидРабот,
	 |	Лико_Затраты.ВидСекции,
	 |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	 |	Лико_Затраты.НомерРаботы
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	Лико_Затраты.ЗаказКлиента,
	 |	Лико_Затраты.РЦ,
	 |	Лико_Затраты.Затрата,
	 |	Лико_Затраты.СтатьяЗатрат,
	 |	Лико_Затраты.НомерПроката,
	 |	Лико_Затраты.Нарезка,
	 |	Лико_Затраты.Количество,
	 |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	 |	Лико_Затраты.Сумма,
	 |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка),
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	 |	КОНЕЦ,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	 |	КОНЕЦ,
	 |	Лико_Затраты.ВидРабот,
	 |	Лико_Затраты.ВидСекции,
	 |	Лико_Затраты.НомерРаботы
	 |ИЗ
	 |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	 |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	 |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	 |ГДЕ
	 |	Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	 |	И Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	 |	И Лико_Затраты.НомерПроката = &НомерПроката
	 |	И ЕСТЬNULL(Лико_Затраты.Нарезка, 0) <> 0
	 |	И Лико_Затраты.РЦ.ВидРабочегоЦентра = &ВидРабочегоЦентра
	 |	И Лико_Затраты.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	 |	И Лико_Затраты.РЦ.ВидРабочегоЦентра <> Лико_Затраты.РабочийЦентр.ВидРабочегоЦентра
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Лико_Затраты.ЗаказКлиента,
	 |	Лико_Затраты.Затрата,
	 |	Лико_Затраты.СтатьяЗатрат,
	 |	Лико_Затраты.НомерПроката,
	 |	Лико_Затраты.Нарезка,
	 |	Лико_Затраты.Количество,
	 |	Лико_Затраты.Сумма,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	 |	КОНЕЦ,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	 |	КОНЕЦ,
	 |	Лико_Затраты.РЦ,
	 |	Лико_Затраты.ВидРабот,
	 |	Лико_Затраты.ВидСекции,
	 |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	 |	Лико_Затраты.НомерРаботы
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	Лико_Затраты.ЗаказКлиента,
	 |	Лико_Затраты.РЦ,
	 |	Лико_Затраты.Затрата,
	 |	Лико_Затраты.СтатьяЗатрат,
	 |	Лико_Затраты.НомерПроката,
	 |	Лико_Затраты.Нарезка,
	 |	Лико_Затраты.Количество,
	 |	Лико_Затраты.Количество,
	 |	Лико_Затраты.Сумма,
	 |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка),
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	 |	КОНЕЦ,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	 |	КОНЕЦ,
	 |	Лико_Затраты.ВидРабот,
	 |	Лико_Затраты.ВидСекции,
	 |	Лико_Затраты.НомерРаботы
	 |ИЗ
	 |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	 |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	 |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	 |ГДЕ
	 |	Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	 |	И ВЫБОР
	 |			КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	 |				ТОГДА Лико_Затраты.Затрата.ВидНоменклатуры = &ВидНоменклатурыКраска
	 |			ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура.ВидНоменклатуры = &ВидНоменклатурыКраска
	 |		КОНЕЦ
	 |	И Лико_Затраты.НомерПроката = &НомерПроката
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Лико_Затраты.ЗаказКлиента,
	 |	Лико_Затраты.Затрата,
	 |	Лико_Затраты.СтатьяЗатрат,
	 |	Лико_Затраты.НомерПроката,
	 |	Лико_Затраты.Нарезка,
	 |	Лико_Затраты.Количество,
	 |	Лико_Затраты.Сумма,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	 |	КОНЕЦ,
	 |	ВЫБОР
	 |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	 |			ТОГДА Лико_Затраты.Затрата
	 |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	 |	КОНЕЦ,
	 |	Лико_Затраты.РЦ,
	 |	Лико_Затраты.ВидРабот,
	 |	Лико_Затраты.ВидСекции,
	 |	Лико_Затраты.НомерРаботы,
	 |	Лико_Затраты.Количество
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Вт.ЗаказКлиента КАК ЗаказКлиента,
	 |	Вт.РабочийЦентр КАК РабочийЦентр,
	 |	Вт.Затрата КАК Затрата,
	 |	Вт.СтатьяЗатрат КАК СтатьяЗатрат,
	 |	Вт.НомерПроката КАК НомерПроката,
	 |	Вт.Нарезка КАК Нарезка,
	 |	Вт.Сумма КАК Сумма,
	 |	Вт.Характеристика КАК Характеристика,
	 |	Вт.Номенклатура КАК Номенклатура,
	 |	Вт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	 |	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК КоличествоУпаковок1,
	 |	ВЫБОР
	 |		КОГДА Вт.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	 |				И Вт.Нарезка.Размер <> 0
	 |			ТОГДА Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ * (Вт.Нарезка.Размер / 1000)
	 |	КОНЕЦ КАК Количество1,
	 |	Вт.Количество КАК Количество,
	 |	Вт.КоличествоУпаковок КАК КоличествоУпаковок,
	 |	Вт.ВидРабот КАК ВидРабот,
	 |	Вт.ВидСекции КАК ВидСекции,
	 |	Вт.НомерРаботы КАК НомерРаботы
	 |ИЗ
	 |	Вт КАК Вт
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	 |		ПО Вт.ЗаказКлиента = Лико_ПараметрыПроизводстваЗаказа.Заказ
	 |			И Вт.РабочийЦентр = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр
	 |			И Вт.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	СтатьяЗатрат УБЫВ";	
	 Запрос.УстановитьПараметр("ВидНоменклатурыНарезки", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра);
	 Запрос.УстановитьПараметр("ВидНоменклатурыКраска", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);
	 
	 
	 
 КонецПроцедуры //-Лико m.shenderov 21.12.2017


Процедура СформироватьЗапросПоМатериалуВЗаказеNF(Запрос)Экспорт  //+Лико m.shenderov 21.12.2017
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос.Текст="ВЫБРАТЬ
	             |	Лико_Затраты.ЗаказКлиента КАК ЗаказКлиента,
	             |	Лико_Затраты.РабочийЦентр КАК РабочийЦентр,
	             |	Лико_Затраты.Затрата КАК Затрата,
	             |	Лико_Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката КАК НомерПроката,
	             |	Лико_Затраты.Нарезка КАК Нарезка,
	             |	Лико_Затраты.Количество КАК Количество,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000) КАК КоличествоУпаковок,
	             |	Лико_Затраты.Сумма КАК Сумма,
	             |	МАКСИМУМ(ХарактеристикиНоменклатуры.Ссылка) КАК Характеристика,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ КАК Номенклатура,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ КАК ЦеноваяГруппа,
	             |	Лико_Затраты.ВидРабот КАК ВидРабот,
	             |	Лико_Затраты.ВидСекции КАК ВидСекции,
	             |	Лико_Затраты.НомерРаботы КАК НомерРаботы
	             |ПОМЕСТИТЬ Вт
	             |ИЗ
	             |	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	             |		ПО (ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатурыНарезки)
	             |			И Лико_Затраты.Нарезка = ХарактеристикиНоменклатуры.ЯССМ_Нарезка
	             |ГДЕ
	             |	Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	             |	И Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	             |	И Лико_Затраты.НомерПроката = &НомерПроката
	             |	И ЕСТЬNULL(Лико_Затраты.Нарезка, 0) <> 0
	             |	И ВЫБОР
	             |			КОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	             |				ТОГДА Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	             |			ИНАЧЕ Лико_Затраты.РабочийЦентр = &РабочийЦентр
	             |		КОНЕЦ
	             |	И Лико_Затраты.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Лико_Затраты.ЗаказКлиента,
	             |	Лико_Затраты.РабочийЦентр,
	             |	Лико_Затраты.Затрата,
	             |	Лико_Затраты.СтатьяЗатрат,
	             |	Лико_Затраты.НомерПроката,
	             |	Лико_Затраты.Нарезка,
	             |	Лико_Затраты.Количество,
	             |	Лико_Затраты.Сумма,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.Номенклатура
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ОсновнаяНоменклатура
	             |	КОНЕЦ,
	             |	ВЫБОР
	             |		КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	             |			ТОГДА Лико_Затраты.Затрата
	             |		ИНАЧЕ Лико_Затраты.Затрата.ЦеноваяГруппа
	             |	КОНЕЦ,
	             |	Лико_Затраты.ВидРабот,
	             |	Лико_Затраты.ВидСекции,
	             |	Лико_Затраты.Количество / (Лико_Затраты.Нарезка.Размер / 1000),
	             |	Лико_Затраты.НомерРаботы
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Вт.ЗаказКлиента КАК ЗаказКлиента,
	             |	Вт.РабочийЦентр КАК РабочийЦентр,
	             |	Вт.Затрата КАК Затрата,
	             |	Вт.СтатьяЗатрат КАК СтатьяЗатрат,
	             |	Вт.НомерПроката КАК НомерПроката,
	             |	Вт.Нарезка КАК Нарезка,
	             |	Вт.Сумма КАК Сумма,
	             |	Вт.Характеристика КАК Характеристика,
	             |	Вт.Номенклатура КАК Номенклатура,
	             |	Вт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	             |	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК КоличествоУпаковок1,
	             |	ВЫБОР
	             |		КОГДА Вт.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	             |				И Вт.Нарезка.Размер <> 0
	             |			ТОГДА Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ * (Вт.Нарезка.Размер / 1000)
	             |	КОНЕЦ КАК Количество1,
	             |	Вт.Количество КАК Количество,
	             |	Вт.КоличествоУпаковок КАК КоличествоУпаковок,
	             |	Вт.ВидРабот КАК ВидРабот,
	             |	Вт.ВидСекции КАК ВидСекции,
	             |	Вт.НомерРаботы КАК НомерРаботы
	             |ИЗ
	             |	Вт КАК Вт
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	             |		ПО Вт.ЗаказКлиента = Лико_ПараметрыПроизводстваЗаказа.Заказ
	             |			И Вт.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	             |ГДЕ
	             |	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Newfoil)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СтатьяЗатрат УБЫВ";	
	Запрос.УстановитьПараметр("ВидНоменклатурыНарезки", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра);
	
	
КонецПроцедуры //-Лико m.shenderov 21.12.2017


Функция ПолучитьВидРаботыИзРезерваМатериалаСтарый(ЗаказКлиента,Номенклатура) Экспорт  //+Лико m.shenderov 22.11.2018
	Структура = Новый Структура;
	Структура.Вставить("ВидРабот");
	Структура.Вставить("НомерРаботы");
	Структура.Вставить("СтатьяЗатрат");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Лико_ПодготовкаМатериаловРезервирование.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|				И Лико_ПодготовкаМатериаловРезервирование.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|		ИНАЧЕ Лико_ПодготовкаМатериаловРезервирование.ВидРабот
	|	КОНЕЦ КАК ВидРаботы,
	|	Лико_ПодготовкаМатериаловРезервирование.НомерРаботы КАК НомерРаботы,
	|	Лико_ПодготовкаМатериаловРезервирование.СтатьяЗатрат КАК СтатьяЗатрат
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
	|ГДЕ
	|	Лико_ПодготовкаМатериаловРезервирование.Номенклатура = &Номенклатура
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента = &ЗаказКлиента
	|	И НЕ Лико_ПодготовкаМатериаловРезервирование.Ссылка.СнятиеРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.ВидРаботы КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА Вт.ВидРаботы = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|				И Вт.НомерРаботы = 0
	|			ТОГДА 1
	|		ИНАЧЕ Вт.НомерРаботы
	|	КОНЕЦ КАК НомерРаботы,
	|	Вт.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	Вт КАК Вт";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );
	//Запрос.УстановитьПараметр("НомерПроката",НомерПроката );
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура.ВидРабот=Выборка.ВидРабот;
		Структура.НомерРаботы=Выборка.НомерРаботы;
		Структура.СтатьяЗатрат=Выборка.СтатьяЗатрат;
		
	КонецЦикла; 
	
	Возврат Структура;
	
КонецФункции //-Лико m.shenderov 22.11.2018 


Функция ПолучитьВидРаботыИзРезерваМатериала210220(ЗаказКлиента,Номенклатура) Экспорт  //+Лико m.shenderov 22.11.2018
	Структура = Новый Структура;
	Структура.Вставить("ВидРабот");
	Структура.Вставить("НомерРаботы");
	Структура.Вставить("СтатьяЗатрат");
	Структура.Вставить("МассивВидыРабот");
	Структура.Вставить("СтруктураВидыРабот");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Лико_ПодготовкаМатериаловРезервирование.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|				И Лико_ПодготовкаМатериаловРезервирование.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|		ИНАЧЕ Лико_ПодготовкаМатериаловРезервирование.ВидРабот
	|	КОНЕЦ КАК ВидРаботы,
	|	Лико_ПодготовкаМатериаловРезервирование.НомерРаботы КАК НомерРаботы,
	|	Лико_ПодготовкаМатериаловРезервирование.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Лико_ПодготовкаМатериаловРезервирование.Номенклатура КАК Номенклатура,
	|	Лико_ПодготовкаМатериаловРезервирование.ВидРабот КАК ВидРабот
	|ПОМЕСТИТЬ ВтПоЗаказу
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
	|ГДЕ
	|	Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента = &ЗаказКлиента
	|	И НЕ Лико_ПодготовкаМатериаловРезервирование.Ссылка.СнятиеРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПоЗаказу.ВидРаботы КАК ВидРаботы,
	|	ВтПоЗаказу.НомерРаботы КАК НомерРаботы,
	|	ВтПоЗаказу.СтатьяЗатрат КАК СтатьяЗатрат
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	ВтПоЗаказу КАК ВтПоЗаказу
	|ГДЕ
	|	ВтПоЗаказу.Номенклатура = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.ВидРаботы КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА Вт.ВидРаботы = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|				И Вт.НомерРаботы = 0
	|			ТОГДА 1
	|		ИНАЧЕ Вт.НомерРаботы
	|	КОНЕЦ КАК НомерРаботы,
	|	Вт.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	ВтПоЗаказу КАК Вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПоЗаказу.ВидРаботы КАК ВидРаботы,
	|	МАКСИМУМ(ВтПоЗаказу.НомерРаботы) КАК НомерРаботы
	|ИЗ
	|	ВтПоЗаказу КАК ВтПоЗаказу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтПоЗаказу.ВидРаботы";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );
	//Запрос.УстановитьПараметр("НомерПроката",НомерПроката );
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура.ВидРабот=Выборка.ВидРабот;
		Структура.НомерРаботы=Выборка.НомерРаботы;
		Структура.СтатьяЗатрат=Выборка.СтатьяЗатрат;
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Структура.МассивВидыРабот=РезультатЗапроса[3].Выгрузить().ВыгрузитьКолонку("ВидРаботы");
	Массив = Новый Массив();
	Пока Выборка.Следующий() Цикл
		СтрВидРабот = Новый Структура;  		
		СтрВидРабот.Вставить("ВидРаботы",Выборка.ВидРаботы);
		СтрВидРабот.Вставить("ВсегоРабот",Выборка.НомерРаботы);
		Массив.Добавить(СтрВидРабот); 
	КонецЦикла; 
	Структура.Вставить("СтруктураВидыРабот",Массив);
	
	Возврат Структура;
	
КонецФункции //-Лико m.shenderov 22.11.2018 


Функция ПолучитьВидРаботыИзРезерваМатериала(ЗаказКлиента,Номенклатура,Нарезка=Неопределено) Экспорт  //+Лико m.shenderov 22.11.2018
	
	Структура = Новый Структура;
	Структура.Вставить("ВидРабот");
	Структура.Вставить("НомерРаботы");
	Структура.Вставить("СтатьяЗатрат");
	Структура.Вставить("СписокВидовРабот");
	Структура.Вставить("Настройка");
	Структура.Вставить("Печать");
	Структура.Вставить("ВидСекции");

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Лико_ПодготовкаМатериаловРезервирование.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|				И Лико_ПодготовкаМатериаловРезервирование.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|		ИНАЧЕ Лико_ПодготовкаМатериаловРезервирование.ВидРабот
	|	КОНЕЦ КАК ВидРаботы,
	|	Лико_ПодготовкаМатериаловРезервирование.НомерРаботы КАК НомерРаботы,
	|	Лико_ПодготовкаМатериаловРезервирование.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Лико_ПодготовкаМатериаловРезервирование.Настройка КАК Настройка,
	|	Лико_ПодготовкаМатериаловРезервирование.Печать КАК Печать,
	|	Лико_ПодготовкаМатериаловРезервирование.ВидСекции КАК ВидСекции
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
	|ГДЕ
	|	Лико_ПодготовкаМатериаловРезервирование.Номенклатура = &Номенклатура
	|	И Лико_ПодготовкаМатериаловРезервирование.Ссылка.ЗаказКлиента = &ЗаказКлиента
	|	И НЕ Лико_ПодготовкаМатериаловРезервирование.Ссылка.СнятиеРезерва
	|	И ВЫБОР
	|			КОГДА &ЕстьНарезка
	|				ТОГДА Лико_ПодготовкаМатериаловРезервирование.Нарезка = &Нарезка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.ВидРаботы КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА Вт.ВидРаботы = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|				И Вт.НомерРаботы = 0
	|			ТОГДА 1
	|		ИНАЧЕ Вт.НомерРаботы
	|	КОНЕЦ КАК НомерРаботы,
	|	Вт.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Вт.Настройка КАК Настройка,
	|	Вт.Печать КАК Печать,
	|	Вт.ВидСекции КАК ВидСекции
	|ИЗ
	|	Вт КАК Вт
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.ВидРаботы,
	|	Вт.СтатьяЗатрат,
	|	Вт.Настройка,
	|	Вт.Печать,
	|	ВЫБОР
	|		КОГДА Вт.ВидРаботы = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|				И Вт.НомерРаботы = 0
	|			ТОГДА 1
	|		ИНАЧЕ Вт.НомерРаботы
	|	КОНЕЦ,
	|	Вт.ВидСекции";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );
	//Запрос.УстановитьПараметр("НомерПроката",НомерПроката );
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("ЕстьНарезка",ЗначениеЗаполнено(Нарезка));
	Запрос.УстановитьПараметр("Нарезка",Нарезка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Сч=0;
	Массив = Новый Массив();
	Пока Выборка.Следующий() Цикл
		Если Сч=0 Тогда 
			Структура.ВидРабот=Выборка.ВидРабот;
			Структура.НомерРаботы=Выборка.НомерРаботы;
			Структура.СтатьяЗатрат=Выборка.СтатьяЗатрат;
			Структура.Настройка=Выборка.Настройка;
			Структура.Печать=Выборка.Печать;
			Структура.ВидСекции=Выборка.ВидСекции;

		КонецЕсли;
		Сч=1;
		Структура2 = Новый Структура;
		Структура2.Вставить("ВидРабот",Выборка.ВидРабот);
		Структура2.Вставить("НомерРаботы",Выборка.НомерРаботы);
		Структура2.Вставить("СтатьяЗатрат",Выборка.СтатьяЗатрат);
		Структура2.Вставить("Настройка",Выборка.Настройка);
		Структура2.Вставить("Печать",Выборка.Печать); 
		Структура2.Вставить("ВидСекции",Выборка.ВидСекции);

		Массив.Добавить(Структура2);
	КонецЦикла; 
	Структура.СписокВидовРабот=Массив;
	Возврат Структура;
	
КонецФункции //-Лико m.shenderov 22.11.2018 


Функция ПолучитьВидыСекцийИзЗаказа(ЗаказКлиента,НомерПроката) Экспорт 	
	Структура = Новый Структура;
	Структура.Вставить("ВидРабот");
	Структура.Вставить("НомерРаботы");
	Структура.Вставить("СтатьяЗатрат");
	Структура.Вставить("СписокВидовРабот");
	Структура.Вставить("Настройка");
	Структура.Вставить("Печать");
	Структура.Вставить("ВидСекции");

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Лико_Затраты.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|		ИНАЧЕ Лико_Затраты.ВидРабот
	|	КОНЕЦ КАК ВидРаботы,
	|	Лико_Затраты.НомерРаботы КАК НомерРаботы,
	|	Лико_Затраты.ВидСекции КАК ВидСекции
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	|ГДЕ
	|	Лико_Затраты.ЗаказКлиента = &ЗаказКлиента
	|	И Лико_Затраты.СтатьяЗатрат В (&ОсновнойМатериал, &ДопМатериал)
	|	И Лико_Затраты.НомерПроката = &НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вт.ВидРаботы КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА Вт.НомерРаботы = 0
	|			ТОГДА 1
	|		ИНАЧЕ Вт.НомерРаботы
	|	КОНЕЦ КАК НомерРаботы,
	|	Вт.ВидСекции КАК ВидСекции
	|ИЗ
	|	Вт КАК Вт
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.ВидРаботы,
	|	Вт.ВидСекции,
	|	ВЫБОР
	|		КОГДА Вт.НомерРаботы = 0
	|			ТОГДА 1
	|		ИНАЧЕ Вт.НомерРаботы
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСекции,
	|	НомерРаботы";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );   
	Запрос.УстановитьПараметр("НомерПроката",НомерПроката ); 

	Запрос.УстановитьПараметр("ОсновнойМатериал",Справочники.Лико_СтатьиЗатрат.ОсновнойМатериал );
Запрос.УстановитьПараметр("ДопМатериал",Справочники.Лико_СтатьиЗатрат.ДополнительныеМатериалы );

		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Сч=0;
	Массив = Новый Массив();
	Пока Выборка.Следующий() Цикл
				Сч=1;
		Структура2 = Новый Структура;
		Структура2.Вставить("ВидРабот",Выборка.ВидРабот);
		Структура2.Вставить("НомерРаботы",Выборка.НомерРаботы);
		Структура2.Вставить("ВидСекции",Выборка.ВидСекции);

		Массив.Добавить(Структура2);
	КонецЦикла; 
	Возврат Массив;
	
КонецФункции //-Лико m.shenderov 22.11.2018 






/// Определяет список команд отчетов.
//
// Параметры:
//   Структура - ЗаказКлиента.
//      	   - НомерПроката.
//   		   - РабочийЦентр 
//
Процедура СоздатьРедактироватьДокументПодготовки080621(Знач Структура)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента
	|	И Лико_ПодготовкаМатериалов.НомерПроката = &НомерПроката";
	Запрос.УстановитьПараметр("ЗаказКлиента",Структура.ЗаказКлиента );
	Запрос.УстановитьПараметр("НомерПроката",Структура.НомерПроката );
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Документ=Документы.Лико_ПодготовкаМатериалов.СоздатьДокумент();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 		
		Документ=Выборка.Ссылка.ПолучитьОбъект();
		Документ.ПометкаУдаления=Ложь;  
	КонецЕсли;  
	
	
	
	Документ.Дата=ТекущаяДата();
	Документ.Заполнить(Структура);
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура СоздатьРедактироватьДокументПодготовки(Знач Структура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента
	|	И Лико_ПодготовкаМатериалов.НомерПроката = &НомерПроката";
	Запрос.УстановитьПараметр("ЗаказКлиента",Структура.ЗаказКлиента );
	Запрос.УстановитьПараметр("НомерПроката",Структура.НомерПроката );

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Документ=Документы.Лико_ПодготовкаМатериалов.СоздатьДокумент();
		Документ.Дата=ТекущаяДата();
	    Документ.Заполнить(Структура);

	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 		
		Документ=Выборка.Ссылка.ПолучитьОбъект();
		Документ.ПометкаУдаления=Ложь;  
	КонецЕсли;  



		Документ.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры



// Определяет список команд отчетов.
//
// Параметры:
//   Структура - ЗаказКлиента.
//      	   - НомерПроката.
//   		   - РабочийЦентр 
//
Процедура ФормированиеДокументаПодготовкаМатериаловПриПланированииРЦ(Знач Структура) Экспорт//+Лико m.shenderov 10/12/2019
	Если ТипЗнч(Структура.РабочийЦентр)=Тип("СправочникСсылка.РабочиеЦентры")   Тогда 
		Если Структура.РабочийЦентр.Лико_ФормированиеДокументаПодготовкаМатериаловПриПланированииРЦ Тогда
			СоздатьРедактироватьДокументПодготовки(Структура);
		КонецЕсли;
	КонецЕсли;	
	
	
КонецПроцедуры //-Лико m.shenderov 10/12/2019


Функция ПолучитьДокумент(ЗаказКлиента,НомерПроката) Экспорт //+Лико m.shenderov 16.01.2018
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.Проведен
	|	И НЕ Лико_ПодготовкаМатериалов.ПометкаУдаления
	|	И Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента
	|	И Лико_ПодготовкаМатериалов.НомерПроката = &НомерПроката";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );  
	Запрос.УстановитьПараметр("НомерПроката",НомерПроката );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат  Выборка.Ссылка; 		
	КонецЦикла; 
	Возврат Документы.Лико_ПодготовкаМатериалов.ПустаяСсылка(); 
	
КонецФункции


#КонецОбласти 


//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт 
	//МеханизмыДокумента.Добавить("ЗакрытиеБланков"); 
	МеханизмыДокумента.Добавить("АдресныйСклад");
    МеханизмыДокумента.Добавить("Лико_Склад");
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаЛико_МатериалыВРезерве(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции
 
//- <--- Лико2.5 m.shenderov 30.03.2022
